glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
//================================================================================
//Private
//================================================================================

static ARM_DRIVER_VERSION ARM_USARTx_GetVersion(void)
{
    return ARM_USART_Driver_Version;
}

static ARM_USART_CAPABILITIES ARM_USART_GetCapabilities(ARM_USART_Resources_t *usart)
{
    return usart->capabilities;
}

static int32_t ARM_USART_Initialize(ARM_USART_SignalEvent_t  cb_event,
                                    ARM_USART_Resources_t         *usart)
{
    if(usart->p_info->flags & ARM_USART_FLAG_INITIALIZED) {
        // Driver is already initialized
        return ARM_DRIVER_OK;
    }
    // Initialize USART Run-time Resources
    usart->p_info->cb_event = cb_event;

    // Clear driver variables
    usart->p_info->flags                        = 0U;
    usart->p_info->mode                         = 0U;
    usart->p_info->baudrate                     = 0U;
    usart->p_info->xfer_status.tx_busy          = 0U;
    usart->p_info->xfer_status.rx_busy          = 0U;
    usart->p_info->xfer_status.tx_underflow     = 0U;
    usart->p_info->xfer_status.rx_overflow      = 0U;
    usart->p_info->xfer_status.rx_break         = 0U;
    usart->p_info->xfer_status.rx_framing_error = 0U;
    usart->p_info->xfer_status.rx_parity_error  = 0U;
    usart->p_info->xfer_info.tx_def_val         = 0U;
    usart->p_info->xfer_info.rx_dump_val        = 0U;

// Configure CTS pin
    if(usart->capabilities.cts) {
        ARM_RCC_Periph_ClockCmd(usart-> p_pin[CTS_PIN].port, ENABLE_CMD);
        GPIO_SetData(usart-> p_pin[CTS_PIN].GPIOx, usart-> p_pin[CTS_PIN].pin,
                     ARM_GPIO_IO_MODE_INPUT, ARM_GPIO_IO_TYPE_OPEN_DRAIN , ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                     usart-> p_pin[CTS_PIN].alt_func);
    }
// Configure RTS pin
    if(usart->capabilities.rts) {
        ARM_RCC_Periph_ClockCmd(usart-> p_pin[RTS_PIN].port, ENABLE_CMD);
        GPIO_SetData(usart-> p_pin[RTS_PIN].GPIOx, usart-> p_pin[RTS_PIN].pin,
                     ARM_GPIO_IO_MODE_OUTPUT, ARM_GPIO_IO_TYPE_PUSH_PULL, ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                     usart-> p_pin[RTS_PIN].alt_func);
    }

// TX, RX, CK pins are configurated in function ARM_USART_Control.

// DMA Initialize
    //unsupported in Version 1.0
    usart->p_info->flags |= ARM_USART_FLAG_INITIALIZED;
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Uninitialize(ARM_USART_Resources_t *usart)
{
// Reset TX pin configuration
    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin, 0U, 0U, 0U, 0U, 0U);
// Reset RX pin configuration
    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin, 0U, 0U, 0U, 0U, 0U);
// Unconfigure CTS pin
    if(usart->capabilities.cts) {
        GPIO_SetData(usart-> p_pin[CTS_PIN].GPIOx, usart-> p_pin[CTS_PIN].pin, 0U, 0U, 0U, 0U, 0U);
    }
// Unconfigure RTS pin
    if(usart->capabilities.rts) {
        GPIO_SetData(usart-> p_pin[RTS_PIN].GPIOx, usart-> p_pin[RTS_PIN].pin, 0U, 0U, 0U, 0U, 0U);
    }
// DMA Uninitialize function
    //unsupported in Version 1.0

// Reset USART status flags
    usart->p_info->flags = 0UL;
    return ARM_DRIVER_OK;
}

/***********************************************************************************
To stop working with a peripheral the functions PowerControl and Uninitialize need
to be called in this order:
drv->PowerControl (ARM_POWER_OFF);     // Terminate any pending transfers, reset IRQ/DMA, power off peripheral
drv->Uninitialize (...);               // Release I/O pins
************************************************************************************/

static int32_t ARM_USART_PowerControl(ARM_POWER_STATE  state,
                                      ARM_USART_Resources_t *usart)
{
    switch(state) {
        case ARM_POWER_OFF: {
            // Disable USART IRQ
            NVIC_DisableIRQ(usart->irq_num);

            ARM_RCC_Periph_ClockCmd(usart->usart_name, ENABLE_CMD);
            // Reset USART registers
            ARM_RCC_Periph_ResetCmd(usart->usart_name, ENABLE_CMD);
            // Release reset signal from USART
            ARM_RCC_Periph_ResetCmd(usart->usart_name, DISABLE_CMD);
            // Disable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, DISABLE_CMD);
            // Clear pending USART interrupts in NVIC
            NVIC_ClearPendingIRQ(usart->irq_num);
            // Clear driver variables
            usart->p_info->flags                        = 0U;
            usart->p_info->mode                         = 0U;
            usart->p_info->baudrate                     = 0U;
            usart->p_info->xfer_status.tx_busy          = 0U;
            usart->p_info->xfer_status.rx_busy          = 0U;
            usart->p_info->xfer_status.tx_underflow     = 0U;
            usart->p_info->xfer_status.rx_overflow      = 0U;
            usart->p_info->xfer_status.rx_break         = 0U;
            usart->p_info->xfer_status.rx_framing_error = 0U;
            usart->p_info->xfer_status.rx_parity_error  = 0U;
            usart->p_info->xfer_info.tx_def_val         = 0U;
            usart->p_info->xfer_info.rx_dump_val        = 0U;
            usart->p_info->flags &= ~ARM_USART_FLAG_POWERED;
            break;
        }
        case ARM_POWER_LOW: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
        case ARM_POWER_FULL: {
            if((usart->p_info->flags & ARM_USART_FLAG_INITIALIZED) == 0U) {
                return ARM_DRIVER_ERROR;
            }
            if((usart->p_info->flags & ARM_USART_FLAG_POWERED)     != 0U) {
                return ARM_DRIVER_OK;
            }
            // Enable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, ENABLE_CMD);
            // Reset USART registers
            ARM_RCC_Periph_ResetCmd(usart->usart_name, ENABLE_CMD);
            // Release reset signal from USART
            ARM_RCC_Periph_ResetCmd(usart->usart_name, DISABLE_CMD);
            usart->p_info->flags |= ARM_USART_FLAG_POWERED;
            // Clear and Enable USART IRQ
            NVIC_ClearPendingIRQ(usart->irq_num);
            NVIC_EnableIRQ(usart->irq_num);
            break;
        }
        default: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
    }
    return ARM_DRIVER_OK;
}

