glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
      End of Miscellaneous Controls Section

    **************************************************************************/

    //USART Mode
    uint8_t mode = 0U;
    switch(control & ARM_USART_CONTROL_Msk) {
        case ARM_USART_MODE_ASYNCHRONOUS: {
            if(usart->capabilities.asynchronous) {
                mode = ARM_USART_MODE_ASYNCHRONOUS;
            } else {
                return ARM_USART_ERROR_MODE;
            }
            break;
        }
        case ARM_USART_MODE_SYNCHRONOUS_MASTER: {
            if(usart->capabilities.synchronous_master) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        case ARM_USART_MODE_SYNCHRONOUS_SLAVE: {
            //the mode is unsupported in STM32F407
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
        case ARM_USART_MODE_SINGLE_WIRE: {
            if(usart->capabilities.single_wire) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        case ARM_USART_MODE_IRDA: {
            if(usart->capabilities.irda) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        case ARM_USART_MODE_SMART_CARD: {
            if(usart->capabilities.smart_card) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        //unsupported commands
        default: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
    }

    //USART Data Bits
    switch(control & ARM_USART_DATA_BITS_Msk) {
        case ARM_USART_DATA_BITS_5: {
            return ARM_USART_ERROR_DATA_BITS;
        }
        case ARM_USART_DATA_BITS_6: {
            return ARM_USART_ERROR_DATA_BITS;
        }
        case ARM_USART_DATA_BITS_7: {
            return ARM_USART_ERROR_DATA_BITS;
        }
        case ARM_USART_DATA_BITS_8: {
            usart->p_reg->CR1 &= ~USART_CR1_M_Msk;
            usart->p_reg->CR1 &= ~USART_CR1_M;
            break;
        }
        case ARM_USART_DATA_BITS_9: {
            usart->p_reg->CR1 &= ~USART_CR1_M_Msk;
            usart->p_reg->CR1 |= USART_CR1_M;
            break;
        }
        default: {
            return ARM_USART_ERROR_DATA_BITS;
        }
    }

    //USART Parity
    switch(control & ARM_USART_PARITY_Msk) {
        case ARM_USART_PARITY_NONE: {
            usart->p_reg->CR1 &= ~USART_CR1_PCE_Msk;
            usart->p_reg->CR1 &= ~USART_CR1_PS_Msk;
            usart->p_reg->CR1 &= ~USART_CR1_PCE;
            break;
        }
        case ARM_USART_PARITY_EVEN: {
            usart->p_reg->CR1 &= ~USART_CR1_PCE_Msk;
            usart->p_reg->CR1 &= ~USART_CR1_PS_Msk;
            usart->p_reg->CR1 |= USART_CR1_PCE;
            usart->p_reg->CR1 &= ~USART_CR1_PS;
            break;
        }
        case ARM_USART_PARITY_ODD: {
            usart->p_reg->CR1 &= ~USART_CR1_PCE_Msk;
            usart->p_reg->CR1 &= ~USART_CR1_PS_Msk;
            usart->p_reg->CR1 |= USART_CR1_PCE;
            usart->p_reg->CR1 |= USART_CR1_PS;
            break;
        }
        default: {
            return ARM_USART_ERROR_PARITY;
        }
    }

    //USART Stop Bits
    switch(control & ARM_USART_STOP_BITS_Msk) {
        case ARM_USART_STOP_BITS_1: {
            usart->p_reg->CR2 &= ~USART_CR2_STOP_Msk;
            usart->p_reg->CR2 &= ~(USART_CR2_STOP_0 | USART_CR2_STOP_1);
            break;
        }
        case ARM_USART_STOP_BITS_2: {
            usart->p_reg->CR2 &= ~USART_CR2_STOP_Msk;
            usart->p_reg->CR2 &= ~USART_CR2_STOP_0;
            usart->p_reg->CR2 |= USART_CR2_STOP_1;
            break;
        }
        case ARM_USART_STOP_BITS_1_5: {
            usart->p_reg->CR2 &= ~USART_CR2_STOP_Msk;
            usart->p_reg->CR2 |= (USART_CR2_STOP_0 | USART_CR2_STOP_1);
            break;
        }
        case ARM_USART_STOP_BITS_0_5: {
            usart->p_reg->CR2 &= ~USART_CR2_STOP_Msk;
            usart->p_reg->CR2 |= USART_CR2_STOP_0;
            usart->p_reg->CR2 &= ~USART_CR2_STOP_1;
            break;
        }
        default: {
            return ARM_USART_ERROR_STOP_BITS;
        }
    }

    //USART Flow Control
    switch(control & ARM_USART_FLOW_CONTROL_Msk) {
        case ARM_USART_FLOW_CONTROL_NONE: {
            usart->p_reg->CR3 &= ~(USART_CR3_RTSE_Msk | USART_CR3_CTSE_Msk);
            break;
        }
        case ARM_USART_FLOW_CONTROL_RTS: {
            if(usart->capabilities.flow_control_rts) {
                usart->p_reg->CR3 &= ~(USART_CR3_RTSE_Msk | USART_CR3_CTSE_Msk);
                usart->p_reg->CR3 |= USART_CR3_RTSE;
            } else {
                return ARM_USART_ERROR_FLOW_CONTROL;
            }
            break;
        }
        case ARM_USART_FLOW_CONTROL_CTS: {
            if(usart->capabilities.flow_control_cts) {
                usart->p_reg->CR3 &= ~(USART_CR3_RTSE_Msk | USART_CR3_CTSE_Msk);
                usart->p_reg->CR3 |= USART_CR3_CTSE;
            } else {
                return ARM_USART_ERROR_FLOW_CONTROL;
            }
            break;
        }
        case ARM_USART_FLOW_CONTROL_RTS_CTS: {
            if(usart->capabilities.flow_control_rts &&
               usart->capabilities.flow_control_cts) {
                usart->p_reg->CR3 &= ~(USART_CR3_RTSE_Msk | USART_CR3_CTSE_Msk);
                usart->p_reg->CR3 |= (USART_CR3_RTSE | USART_CR3_CTSE);
            } else {
                return ARM_USART_ERROR_FLOW_CONTROL;
            }
            break;
        }
        default: {
            return ARM_USART_ERROR_FLOW_CONTROL;
        }
    }

    // Clock setting for synchronous mode
    //USART Clock Polarity (Synchronous mode)
    if((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
       (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
        switch(control & ARM_USART_CPOL_Msk) {
            case ARM_USART_CPOL0:
                usart->p_reg->CR2 &= ~(USART_CR2_CPOL_Msk);
                usart->p_reg->CR2 &= ~(USART_CR2_CPOL);
                break;
            case ARM_USART_CPOL1: {
                usart->p_reg->CR2 &= ~(USART_CR2_CPOL_Msk);
                usart->p_reg->CR2 |= USART_CR2_CPOL;
                break;
            }

            default: {
                return ARM_USART_ERROR_CPOL;
            }
        }
    }

