glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
//USART Clock Phase (Synchronous mode)
    if((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
       (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
        switch(control & ARM_USART_CPHA_Msk) {
            case ARM_USART_CPHA0: {
                usart->p_reg->CR2 &= ~(USART_CR2_CPHA_Msk);
                usart->p_reg->CR2 &= ~(USART_CR2_CPHA);
            }
            break;
            case ARM_USART_CPHA1: {
                usart->p_reg->CR2 &= ~(USART_CR2_CPHA_Msk);
                usart->p_reg->CR2 |= USART_CR2_CPHA;
                break;
            }
            default: {
                return ARM_USART_ERROR_CPHA;
            }
        }
    }

// Configuration is successful - mode id valid
    usart->p_info->mode = mode;
    if(ARM_USART_SetBaudrate(arg, usart) == -1) {
        return ARM_USART_ERROR_BAUDRATE;
    } else {
        usart->p_info->baudrate = arg;
    }
// Set configured flag
    usart->p_info->flags |= ARM_USART_FLAG_CONFIGURED;
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_SetBaudrate(uint32_t arg, ARM_USART_Resources_t *usart)
{
    /*
    baudrate = clock_freq/(8*(2-oversampl8)*div)
    */
    uint32_t div = 0UL;
    uint32_t div_mantissa = 0UL;
    uint32_t div_fraction = 0UL;
    uint32_t oversampl8 = 0UL;
    uint32_t baudrate = arg;

    uint32_t clock_freq = ARM_RCC_GetPeriphClock(usart->usart_name);
    if(clock_freq == 0) {
        return ARM_USART_ERROR_BAUDRATE;
    }
    if(arg == 0) {
        return ARM_USART_ERROR_BAUDRATE;
    }

    uint32_t mode = usart->p_info->mode;
    switch(mode) {
        case ARM_USART_MODE_ASYNCHRONOUS:
        case ARM_USART_MODE_SYNCHRONOUS_MASTER:
        case ARM_USART_MODE_SYNCHRONOUS_SLAVE: {
            oversampl8 = (usart->p_reg->CR1 & USART_CR1_OVER8_Msk) ? 1UL : 0UL;
            break;
        }
        case ARM_USART_MODE_SINGLE_WIRE:
        case ARM_USART_MODE_IRDA:
        case ARM_USART_MODE_SMART_CARD: {
            oversampl8 = 0;
            break;
        }
        default: {
            return ARM_USART_ERROR_BAUDRATE;
        }
    }
    if(oversampl8) {
        /*
        for oversampling by 8
        */
        //for rounding in the least significant bit, multiply by 2,
        //add 1 and shift to the right by 1
        div = (clock_freq * 8 * 2 / (baudrate * 8 * (2 - oversampl8)));
        div |= 1;
        div >>= 1;
        div_mantissa = (uint32_t)((div & ARM_USART_DIVIDER_MANTISSA_FOR_OVER8_MASK) << 1);
        div_fraction = (uint32_t)(div & ARM_USART_DIVIDER_FRACTION_FOR_OVER8_MASK);
    } else {
        /*
        for oversampling by 16
        */
        //for rounding in the least significant bit, multiply by 2,
        //add 1 and shift to the right by 1
        div = (clock_freq * 16 * 2 / (baudrate * 8 * (2 - oversampl8)));
        div |= 1;
        div >>= 1;
        div_mantissa = (uint32_t)(div & ARM_USART_DIVIDER_MANTISSA_FOR_OVER16_MASK);
        div_fraction = (uint32_t)(div & ARM_USART_DIVIDER_FRACTION_FOR_OVER16_MASK);
    }
    usart->p_reg->BRR = (div_mantissa | div_fraction);
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS ARM_USART_GetStatus(ARM_USART_Resources_t *usart)
{
    ARM_USART_STATUS status;
    status.tx_busy = usart->p_info->xfer_status.tx_busy; //Transmitter busy flag
    status.rx_busy = usart->p_info->xfer_status.rx_busy; //Receiver busy flag
    status.tx_underflow = usart->p_info->xfer_status.tx_underflow; //Transmit data underflow detected (cleared on start of next send operation)
    status.rx_overflow = usart->p_info->xfer_status.rx_overflow; //Receive data overflow detected (cleared on start of next receive operation)
    status.rx_break = usart->p_info->xfer_status.rx_break; //Break detected on receive (cleared on start of next receive operation)
    status.rx_framing_error = usart->p_info->xfer_status.rx_framing_error; //Framing error detected on receive (cleared on start of next receive operation)
    status.rx_parity_error = usart->p_info->xfer_status.rx_parity_error; //Parity error detected on receive (cleared on start of next receive operation)
    status.reserved = usart->p_info->xfer_status.reserved;
    return status;
}

static int32_t ARM_USART_SetModemControl(ARM_USART_MODEM_CONTROL control, ARM_USART_Resources_t *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static ARM_USART_MODEM_STATUS ARM_USART_GetModemStatus(ARM_USART_Resources_t *usart)
{
    ARM_USART_MODEM_STATUS status;
    status.cts = usart->p_info->modem_status.cts; //CTS state: 1=Active, 0=Inactive
    status.dsr = usart->p_info->modem_status.dsr; //DSR state: 1=Active, 0=Inactive
    status.dcd = usart->p_info->modem_status.dcd; //DCD state: 1=Active, 0=Inactive
    status.ri = usart->p_info->modem_status.ri; //RI  state: 1=Active, 0=Inactive
    status.reserved = usart->p_info->modem_status.reserved;
    return status;
}

static void USART_IRQHandler(ARM_USART_Resources_t *usart)
{
//to do
}

/*************************************************
Driver capabilities of USART2, USART3, USART6 are completely
similar to USART1 driver capabilities.
***************************************************/
#if (RTE_USART1)

static void ARM_USART1_Resources_Struct_Init(void)
{
    ARM_USART_Resources_t *p_str = &ARM_USART1_Resources;
    p_str->capabilities.asynchronous = 1;               // supports UART (Asynchronous) mode

#if (RTE_USART1_CK_ID > 0)
    p_str->capabilities.synchronous_master = 1;         // supports Synchronous Master mode
#else
    p_str->capabilities.synchronous_master = 0;         // supports Synchronous Master mode
#endif //(RTE_USART1_CK_ID > 0)

    p_str->capabilities.synchronous_slave = 0;          // supports Synchronous Slave mode
    p_str->capabilities.single_wire = 1;                // supports UART Single-wire mode
    p_str->capabilities.irda = 1;                       // supports UART IrDA mode

#if (RTE_USART1_CK_ID > 0)
    p_str->capabilities.smart_card =  1;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  1;          // Smart Card Clock generator available
#else
    p_str->capabilities.smart_card =  0;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  0;          // Smart Card Clock generator available
#endif //(RTE_USART1_CK_ID > 0)

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.flow_control_rts =  1;          // RTS Flow Control available
#else
    p_str->capabilities.flow_control_rts =  0;          // RTS Flow Control available
#endif //(RTE_USART1_CTS_ID > 0) 

#if RTE_USART1_CTS_ID > 0
    p_str->capabilities.flow_control_cts =  1;          // CTS Flow Control available
#else
    p_str->capabilities.flow_control_cts =  0;          // CTS Flow Control available
#endif //(RTE_USART1_CTS_ID > 0)               

    p_str->capabilities.event_tx_complete =  1;         // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    p_str->capabilities.event_rx_timeout =  0;          // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.rts =  1;                       // RTS Line: 0=not available, 1=available
#else
    p_str->capabilities.rts =  0;                       // RTS Line: 0=not available, 1=available
#endif //(RTE_USART1_CTS_ID > 0) 

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.cts =  1;                       // CTS Line: 0=not available, 1=available
#else
    p_str->capabilities.cts =  0;                       // CTS Line: 0=not available, 1=available
#endif //(RTE_USART1_CTS_ID > 0)       

    p_str->capabilities.dtr =  0;                       // DTR Line: 0=not available, 1=available
    p_str->capabilities.dsr =  0;                       // DSR Line: 0=not available, 1=available
    p_str->capabilities.dcd =  0;                       // DCD Line: 0=not available, 1=available
    p_str->capabilities.ri =  0;                        // RI Line: 0=not available, 1=available

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.event_cts = 1;                  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    p_str->capabilities.event_cts =  0;                 // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif //(RTE_USART1_CTS_ID > 0) 

    p_str->capabilities.event_dsr =  0;                 // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    p_str->capabilities.event_dcd =  0;                 // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    p_str->capabilities.event_ri =  0;                  // Signal RI change event: \ref ARM_USART_EVENT_RI
    p_str->capabilities.reserved =  0;                  // Reserved (must be zero)
    p_str->usart_name = USART_1;                        //Interface name
    p_str->p_reg = USART1;                              // Pointer to USART peripheral registers
    p_str->p_pin = USART_GetPinCfg(USART_1);         // Pointer to USART pins configuration
    p_str->irq_num = USART1_IRQn;
    p_str->p_info = &USART1_Info;
}

